In [122]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
                   "date":pd.date_range('20130102', periods=6),
                   "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
                   "age":[23,44,54,32,34,32],
                   "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
                   "price":[1200,np.nan,2133,5433,np.nan,4432]},
                   columns =['id','date','city','category','age','price'])

In [123]:
df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

##数据表检查

#查看数据表的维度

In [124]:
#查看数据表维度
df.shape

(6, 6)

In [125]:
#查看数据表信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

In [126]:
#查看数据表各列格式
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

In [127]:
#查看单列格式
df['price'].dtype

dtype('float64')

In [128]:
#检查数据空值
df.isnull()

      id   date   city category    age  price
0  False  False  False    False  False  False
1  False  False  False    False  False   True
2  False  False  False    False  False  False
3  False  False  False    False  False  False
4  False  False  False    False  False   True
5  False  False  False    False  False  False

In [129]:
#检查特定列空值
df['city'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
Name: city, dtype: bool

In [130]:
#查看city列中的唯一值------------------------------------
df['city'].unique()

array(['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '], dtype=object)

In [131]:
#查看数据表的值
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A', 54,
        2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

In [132]:
#查看列名称
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

In [133]:
#查看前3行数据
df.head(3)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0

In [134]:
#查看最后3行
df.tail(3)

     id       date      city category  age   price
3  1004 2013-01-05  Shenzhen    110-C   32  5433.0
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   32  4432.0

In [135]:
#删除数据表中含有空值的行
df.dropna(how = 'any')

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [136]:
#使用数字0填充数据表中空值
df.fillna(0)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     0.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     0.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [137]:
#使用price均值对NA进行填充
df['price'] = df.fillna(value = df['price'].mean())

In [138]:
#清除city字段中的字符空格
df['city'].map(str.strip)

0      Beijing
1           SH
2    guangzhou
3     Shenzhen
4     shanghai
5      BEIJING
Name: city, dtype: object

In [139]:
#city列大小写转换
df['city'].map(str.lower)
df['city'] = df['city'].map(str.title)

In [140]:
#更改price列数据格式
df['price'].astype('int')

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: price, dtype: int32

In [141]:
#更改列名称
df.rename(columns = {'category':'category-size'})

     id       date         city category-size  age price
0  1001 2013-01-02     Beijing          100-A   23  1001
1  1002 2013-01-03           Sh         100-B   44  1002
2  1003 2013-01-04   Guangzhou          110-A   54  1003
3  1004 2013-01-05     Shenzhen         110-C   32  1004
4  1005 2013-01-06     Shanghai         210-A   34  1005
5  1006 2013-01-07     Beijing          130-F   32  1006

In [142]:
#删除city列后出现的重复值
df['city'].drop_duplicates()

0       Beijing
1             Sh
2     Guangzhou
3       Shenzhen
4       Shanghai
Name: city, dtype: object

In [143]:
#删除city列先出现的重复值
df['city'].drop_duplicates(keep = 'last')

1             Sh
2     Guangzhou
3       Shenzhen
4       Shanghai
5       Beijing
Name: city, dtype: object

In [144]:
#数据替换,将city列中sh替换为shanghai
df['city'].replace('Sh','shanghai')

0       Beijing
1       shanghai
2     Guangzhou
3       Shenzhen
4       Shanghai
5       Beijing
Name: city, dtype: object

## 数据预处理

In [145]:
df1=pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006,1007,1008], 
                  "gender":['male','female','male','female','male','female','male','female'],
                  "pay":['Y','N','Y','Y','N','Y','N','Y',],
                  "m-point":[10,12,20,40,40,40,30,20]})

In [146]:
#数据表df和df1匹配合并-inner方式,并将结果赋值给df_inner
#方法中的how参数可以省略,简写为pd.merge(df,df1,'inner')
df_inner = pd.merge(df,df1,how = 'inner')
df_inner

     id       date         city category  age price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  1002  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y

In [147]:
#尝试用left,right.outer方式合并数据,分别赋值给df_left,df_right,df_outer
df_left = pd.merge(df,df1,'left')
df_left

     id       date         city category  age price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  1002  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y

In [148]:
#为df_inner设置索引列为id
df_inner.set_index('id')

           date         city category  age price  gender  m-point pay
id
1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y
1002 2013-01-03           Sh    100-B   44  1002  female       12   N
1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y
1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y
1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N
1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y

In [149]:
#按age列进行排序
df_inner.sort_values('age')

     id       date         city category  age price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y
3  1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y
5  1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N
1  1002 2013-01-03           Sh    100-B   44  1002  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y

In [150]:
#按索引列排序
df_inner.sort_index()

     id       date         city category  age price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  1002  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y

###数据分组

In [151]:
#使用where方法,新建一列group,如果price列的值>3000，group列显示high，否则显示low
df_inner['group'] = np.where(df_inner['price']>3000,'high','low')
df_inner

     id       date         city category  age price  gender  m-point pay group
0  1001 2013-01-02     Beijing     100-A   23  1001    male       10   Y   low
1  1002 2013-01-03           Sh    100-B   44  1002  female       12   N   low
2  1003 2013-01-04   Guangzhou     110-A   54  1003    male       20   Y   low
3  1004 2013-01-05     Shenzhen    110-C   32  1004  female       40   Y   low
4  1005 2013-01-06     Shanghai    210-A   34  1005    male       40   N   low
5  1006 2013-01-07     Beijing     130-F   32  1006  female       40   Y   low

In [152]:
#使用loc方法,新建sign列,如果price列的值>4000且city列=='beijing',则标记为1
#df.loc的第一个参数是行标签，第二个参数为列标签（可选参数，默认为所有列标签），两个参数既可以是列表也可以是单个字符，如果两个参数都为列表则返回的是DataFrame，否则，则为Series。
#http://blog.csdn.net/chixujohnny/article/details/51095817
df_inner.loc[(df_inner['city'] == 'Beijing')&(df_inner['price']>=4000),'sign'] = 1
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign
0,1001,2013-01-02,Beijing,100-A,23,1001,male,10,Y,low,NaN
1,1002,2013-01-03,Sh,100-B,44,1002,female,12,N,low,NaN
2,1003,2013-01-04,Guangzhou,110-A,54,1003,male,20,Y,low,NaN
3,1004,2013-01-05,Shenzhen,110-C,32,1004,female,40,Y,low,NaN
4,1005,2013-01-06,Shanghai,210-A,34,1005,male,40,N,low,NaN
5,1006,2013-01-07,Beijing,130-F,32,1006,female,40,Y,low,NaN

###数据分列

In [153]:
#对category字段的值依次进行分列，并创建数据表，索引值为df_inner的索引列，列名称为category和size
#实际上下面这段代码是创建了一个dataframe,含有三个参数,第一个为数值,第二个为index,第三个为列名称
temp = pd.DataFrame([x.split('-') for x in df_inner['category']],index = df_inner.index,columns = ['a','b'])

In [154]:
pd.DataFrame([(x,x**2) for x in range(3)],columns = ['a','b'],index = ['yi','er','san'])

     a  b
yi   0  0
er   1  1
san  2  4

In [155]:
#

In [156]:
#将完成分列后的数据表与原df_inner数据表进行匹配
#concat([df1,df2],axis=1) 等价于 merge(df1,df2,left_index=True,right_index=True,how='outer')
#http://blog.csdn.net/u010414589/article/details/51135840
df_inner = pd.merge(df_inner,temp,right_index = True,left_index = True)
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,1001,2013-01-02,Beijing,100-A,23,1001,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,Sh,100-B,44,1002,female,12,N,low,NaN,100,B
2,1003,2013-01-04,Guangzhou,110-A,54,1003,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,1004,female,40,Y,low,NaN,110,C
4,1005,2013-01-06,Shanghai,210-A,34,1005,male,40,N,low,NaN,210,A
5,1006,2013-01-07,Beijing,130-F,32,1006,female,40,Y,low,NaN,130,F

##数据提取

###按标签提取(loc)

In [157]:
#按索引提取单行的数值
#可以看到loc方法用的index是包含的,也就是左闭右闭
#第一个参数为行,第二个参数为列,若有多列,用括号扩上
df_inner.loc[:3,('city','price')]

          city price
0     Beijing   1001
1           Sh  1002
2   Guangzhou   1003
3     Shenzhen  1004

In [158]:
#按索引提取区域行数值

In [159]:
#重设索引
#df_inner.reset_index()
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,1001,2013-01-02,Beijing,100-A,23,1001,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,Sh,100-B,44,1002,female,12,N,low,NaN,100,B
2,1003,2013-01-04,Guangzhou,110-A,54,1003,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,1004,female,40,Y,low,NaN,110,C
4,1005,2013-01-06,Shanghai,210-A,34,1005,male,40,N,low,NaN,210,A
5,1006,2013-01-07,Beijing,130-F,32,1006,female,40,Y,low,NaN,130,F

In [160]:
#设置日期date为索引
df_inner = df_inner.reset_index()
#df_inner = df_inner.set_index('date')
df_inner

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1001,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,1002,female,12,N,low,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,1003,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,1004,female,40,Y,low,NaN,110,C
4,4,1005,2013-01-06,Shanghai,210-A,34,1005,male,40,N,low,NaN,210,A
5,5,1006,2013-01-07,Beijing,130-F,32,1006,female,40,Y,low,NaN,130,F

In [161]:
#提取4日2013-01-04之前的所有数据
#注意比较以下两个语句的差别
df_inner[:3]
df_inner.loc[:3]

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1001,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,1002,female,12,N,low,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,1003,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,1004,female,40,Y,low,NaN,110,C

In [162]:
#使用iloc按位置区域提取数据
df_inner.iloc[:3,:2]

   index    id
0      0  1001
1      1  1002
2      2  1003

In [163]:
#使用iloc按位置单独提取数据
df_inner.iloc[[0,2,5],[4,5]]

  category  age
0    100-A   23
2    110-A   54
5    130-F   32

In [164]:
#使用ix按索引标签和位置混合提取数据
df_inner.ix[:'2013-01-03',:4]

   index    id       date         city
0      0  1001 2013-01-02     Beijing
1      1  1002 2013-01-03           Sh
2      2  1003 2013-01-04   Guangzhou

###按条件提取

In [165]:
#判断city列的值是否为beijing

In [166]:
#先判断city列里是否包含beijing和shanghai，然后将复合条件的数据提取出来。

In [167]:
#将category列密码的数值单独赋值给category

In [168]:
#提取category的前三个字符生成DataFrame

##数据筛选

In [ ]:
#使用“与”条件进行筛选

In [ ]:
#使用“或”条件筛选

In [ ]:
#对筛选后的数据按price字段进行求和

In [ ]:
#使用“非”条件进行筛选

In [ ]:
#对筛选后的数据按city列进行计数

In [ ]:
#使用query函数进行筛选

In [ ]:
#对筛选后的结果按price进行求和

##分类汇总

In [ ]:
#对所有列进行计数汇总

In [ ]:
#对特定的ID列进行计数汇总

In [ ]:
#对两个字段进行汇总计数

In [ ]:
#对city字段进行汇总并计算price的合计和均值。

###数据透视表

In [ ]:
#数据透视表

In [ ]:
#简单的数据采样

In [ ]:
#手动设置采样权重

In [ ]:
#采样后不放回

In [ ]:
#数据表描述性统计

In [ ]:
#标准差

In [ ]:
#两个字段间的协方差

In [ ]:
#数据表中所有字段间的协方差

In [ ]:
#相关性分析

In [ ]:
#数据表相关性分析

In [ ]:
#输出到Excel格式

In [ ]:
#输出到CSV格式